{
    "small_wlan0" : "Wlan0 is the wireless interface associated with the WiFi Pineapples primary radio. This interface is responsible for hosting the Wireless Access Point. It is used by the MK5 Karma and Auto Harvester modules of the PineAP suite. If disabled, the WiFi Pineapple will not host a WiFi network.",
    "small_wlan1" : "Wlan1 is the wireless interface associated with the WiFi Pineapples secondary radio. This interface is responsible for monitoring and injecting WiFi frames (packets) for the Dogma and Beacon Response modules of the PineAP suite. Alternatively, it may also be used with the client-mode feature, providing the WiFi Pineapple and its clients with Internet access from a nearby Access Point.",
    "small_wlan2" : "Wlan2 is the external wireless interface .",
    "route" : "Route displays the IP routing table and default gateway from which the WiFi Pineapple receives Internet access. The default route may be overridden by specifying an IP and interface.",
    "ifconfig" : "The configuration of all network interfaces on the WiFi Pineapple is displayed, showing link status, IP, MAC and transmissions.",
    "wired_internet_settings" : "The WiFi Pineapple may be provided Internet access from its wired Ethernet port in one of two ways.<p><b>Classic Mode</b> assumes the WiFi Pineapple will be connected to a computer with the static IP address of 172.16.42.42 and provided Internet access through Internet Connection Sharing. <p>The typical scenario is a laptop computer and WiFi Pineapple connected to each other via a single Ethernet cable.<p>This may be achieved in Linux using the wp5.sh script from wifipineapple.com/wp5.sh. Refer to the Internet Connection Sharing guides from <a href='http://wiki.wifipineapple.com/'>http://wiki.wifipineapple.com</a> for your particular OS.<p><b>Client Mode</b> enables the WiFi Pineapple to become the client of an existing network.<p>The typical scenario is a WiFi Pineapple connected to a Router or LAN switch via an Ethernet cable. In this case the WiFi Pineapple may receive IP address information from the host network DHCP server, or Static IP address information may be specified.",
    "local_network_settings" : "This advanced feature allows the default LAN settings to be overridden.",
    "open_ap" : "By default the WiFi Pineapple will broadcast a hidden ESSID beginning with \"Pineapple5_\" and ending in the last two octets of the WiFi Pineapples wlan0 MAC address. During an audit, the tester may wish to unhide the Open Access Point and specify an ESSID similar to the contracting clients network.",
    "management_ap" : "Testers are advised to use the WPA2 secured management interface for wireless remote access to the WiFi Pineapple. The SSID and WPA2 password may be specified here. If disabled, the WPA2 network will not broadcast. Please note that the WPA and Open WiFi APs share the same channel.",
    "join_network" : "The WiFi Pineapple may use either its internal second radio, wlan1, or some external WiFi adapters to join a nearby Wireless Access Point as a client as a convenient means for providing Internet access.<p>If using wlan1 in client mode, some PineAP functions (Dogma, Beacon Response) will not be available when the radio is in use.<p>For a list of compatible WiFi adapters see <a href=\"http://wiki.wifipineapple.com\">wiki.wifipineapple.com</a>.",
    "mobile_config" : "Mobile Broadband (3G/4G) modems are a great way to provide an Internet connection to your mobile WiFi Pineapple. Typically there are two types of modems - traditional USB dongles and newer personal hotspots supporting USB tethering.<p><b>USB Mobile Broadband Modems</b><p>Firstly in order for a USB Mobile Broadband Modem to function with the WiFi Pineapple it requires to be supported by the operating system. Thanks to USB ModeSwitch the WiFi Pineapple supports over 300 modems. This is to say that recognized modems will be /modeswitched/, allowing them to transition from being USB Mass Storage devices into being USB Serial devices.<p>The second part of this equation is the successful carrier configuration. The parameters required include an Interface Name, Protocol, Service, Device, APN, Username, Password, Default Route, PPP Redial, Peer DNS, DNS, Keepalive, and PPPD Options. These can be set from Network > Mobile Broadband from the WiFi Pineapple web UI. Most of these parameters, such as APN and Username, depend on the carrier.<p><b>Personal Hotspots supporting USB Tethering</b><p>Much the same as automatic Internet Connection Sharing with tethered Android phones (Froyo and newer), these later type may be easier to configure since the hotspot device manages the connection. This alleviates the operating system from needing to deal with connection interruptions, redial attempts and other networking issues.<p>Typically a Personal Hotspot with a USB Tether feature (sometimes called Ethernet over USB) will automatically enumerate as a new interface (usb0) much the same way an Ethernet interface would (eth0). The Personal Hotspot usually runs a DHCP server and will assign the new usb0 interface an IP address, which the WiFi Pineapple will accept as its default gateway.<p>Because of this a personal hotspot supporting USB tethering is an ideal option, requiring little or no configuration, however the hardware may be more expensive than a traditional USB dongle.<p>Find more information and a list of supported modems from <a href=\"http://wiki.wifipineapple.com\">wiki.wifipineapple.com</a>."
}