{
    "small_dnsspoof" : "DNSSpoof forges replies to arbitrary DNS address / pointer queries on the LAN. This is useful in bypassing hostname-based access controls, or in implementing a variety of man-in-the-middle attacks. For example, the IP address returned for a client lookup of the domain \"example.com\" can be replaced with that of the WiFi Pineapple. In this scenario, clients connected to the WiFi Pineapple attempting to browse to this domain may be redirected to the WiFi Pineapples local web server.",
    "small_cron" : "Cron is a time-based job scheduler. It can be used to schedule jobs such as commands or shell scripts to run periodically at fixed times, dates, or intervals.",
    "webinterface_help" : "Toggle displaying help bubbles, like the one you just clicked :)",
    "dip_configuration" : "The DIP Switches on the WiFi Pineapple Mark V enable user defined boot-modes. Upon boot, the DIP switch positions are queried and the defined commands are executed. By default the commands are executed by /bin/bash, so standard syntax applies. Multiple commands may be executed in sequence by separating them with a semicolon. Alternatively any user defined script may be entered here.",
    "cron" : "Cron is a time-based job scheduler. It can be used to schedule jobs such as commands or shell scripts to run periodically at fixed times, dates, or intervals. See the crontab help below for an example configuration.",
    "spoofhost" : "DNSSpoof forges replies to arbitrary DNS address / pointer queries on the LAN. This is useful in bypassing hostname-based access controls, or in implementing a variety of man-in-the-middle attacks. For example, the IP address returned for a client lookup of the domain \"example.com\" can be replaced with that of the WiFi Pineapple. In this scenario, clients connected to the WiFi Pineapple attempting to browse to this domain may be redirected to the WiFi Pineapples local web server.<p>The Spoofhost editor lists the IP address and Domain names to spoof. The default example replaces example.com with the IP address 172.16.42.1 - the WiFi Pineapple default address. Wildcards may be used in domain names. For example, \"172.16.42.1 example.*\" would spoof all top-level domains for example, such as .com, .net, .org, etc.<p>The wildcard *.* will replace all domains.",
    "index_editor" : "This editor provides a convenient way to modify index.php - the default landing page on the WiFi Pineapples public web server. When a client is directed to the WiFi Pineapples IP address in a web browser, either manually or through DNS Spoofing, this page will be served first.",
    "css_editor" : "The WiFi Pineapple Web-interface is customizable via this CSS template.",
    "reset_reboot" : "Factory Resetting your WiFi Pineapple will restore all default settings. Installed programs and contents of the SD card will not be altered. To completely overwrite your WiFi Pineapples memory please see Firmware Upgrade.",
    "execute_commands" : "For convenience, commands submitted in this form will be immediately executed on your WiFi Pineapple."
}